<a href="https://colab.research.google.com/github/langkh/colabDatasetProjects/blob/main/Class7_Movie_Ratings.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
path_user = "https://raw.githubusercontent.com/yumio/data/main/ml-100k/ml-100k/u.user"

In [ ]:
unames = ['user_id','age','gender','occupation','zip']

In [ ]:
users = pd.read_table(path_user, sep='|',header=None, names=unames)

In [ ]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip         943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [ ]:
users

     user_id  age gender     occupation    zip
0          1   24      M     technician  85711
1          2   53      F          other  94043
2          3   23      M         writer  32067
3          4   24      M     technician  43537
4          5   33      F          other  15213
..       ...  ...    ...            ...    ...
938      939   26      F        student  33319
939      940   32      M  administrator  02215
940      941   20      M        student  97229
941      942   48      F      librarian  78209
942      943   22      M        student  77841

[943 rows x 5 columns]

In [ ]:
mnames = ['movie_id','title']

In [ ]:
path_movie = "https://raw.githubusercontent.com/yumio/data/main/ml-100k/ml-100k/u.item"

In [ ]:
movies = pd.read_table(path_movie, sep ='|', header=None, engine = 'python', names = mnames, usecols = ['movie_id','title'], encoding='latin1')

In [ ]:
movies

      movie_id                                      title
0            1                           Toy Story (1995)
1            2                           GoldenEye (1995)
2            3                          Four Rooms (1995)
3            4                          Get Shorty (1995)
4            5                             Copycat (1995)
...        ...                                        ...
1677      1678                          Mat' i syn (1997)
1678      1679                           B. Monkey (1998)
1679      1680                       Sliding Doors (1998)
1680      1681                        You So Crazy (1994)
1681      1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [ ]:
rnames = ['user_id','movie_id','rating','timestamp']

In [ ]:
path_rating = "https://raw.githubusercontent.com/yumio/data/main/ml-100k/ml-100k/u.data"

In [ ]:
ratings = pd.read_table(path_rating, sep = "\t", header = None, names = rnames)

In [ ]:
ratings

       user_id  movie_id  rating  timestamp
0          196       242       3  881250949
1          186       302       3  891717742
2           22       377       1  878887116
3          244        51       2  880606923
4          166       346       1  886397596
...        ...       ...     ...        ...
99995      880       476       3  880175444
99996      716       204       5  879795543
99997      276      1090       1  874795795
99998       13       225       2  882399156
99999       12       203       3  879959583

[100000 rows x 4 columns]

In [ ]:
df = pd.merge(pd.merge(ratings,users),movies)

In [ ]:
df

       user_id  movie_id  ...    zip                                      title
0          196       242  ...  55105                               Kolya (1996)
1          305       242  ...  94086                               Kolya (1996)
2            6       242  ...  98101                               Kolya (1996)
3          234       242  ...  94702                               Kolya (1996)
4           63       242  ...  75240                               Kolya (1996)
...        ...       ...  ...    ...                                        ...
99995      863      1679  ...  60089                           B. Monkey (1998)
99996      863      1678  ...  60089                          Mat' i syn (1997)
99997      863      1680  ...  60089                       Sliding Doors (1998)
99998      896      1681  ...  91505                        You So Crazy (1994)
99999      916      1682  ...  N2L5N  Scream of Stone (Schrei aus Stein) (1991)

[100000 rows x 9 columns]

In [ ]:
avg_ratings = df.pivot_table(index ='title',values='rating')

In [ ]:
avg_ratings[100:200]

                                                      rating
title
Assignment, The (1997)                              3.500000
Associate, The (1996)                               3.243902
Audrey Rose (1977)                                  2.166667
August (1996)                                       1.000000
Austin Powers: International Man of Mystery (1997)  3.246154
...                                                      ...
Blue Chips (1994)                                   2.666667
Blue Sky (1994)                                     3.416667
Blue in the Face (1995)                             3.177778
Blues Brothers 2000 (1998)                          2.821429
Blues Brothers, The (1980)                          3.836653

[100 rows x 1 columns]

In [ ]:
number_ratings = df.groupby('title').size()

In [ ]:
number_ratings[100:105]

title
Assignment, The (1997)                                 18
Associate, The (1996)                                  41
Audrey Rose (1977)                                     12
August (1996)                                           1
Austin Powers: International Man of Mystery (1997)    130
dtype: int64

In [ ]:
avg_by_gender = df.pivot_table(index = 'title',columns='gender',values='rating')

In [ ]:
avg_by_gender[100:200]

gender                                                     F         M
title
Assignment, The (1997)                              3.000000  3.750000
Associate, The (1996)                               3.923077  2.928571
Audrey Rose (1977)                                  2.000000  2.222222
August (1996)                                            NaN  1.000000
Austin Powers: International Man of Mystery (1997)  3.000000  3.316832
...                                                      ...       ...
Blue Chips (1994)                                   3.000000  2.571429
Blue Sky (1994)                                     3.750000  3.250000
Blue in the Face (1995)                             2.700000  3.314286
Blues Brothers 2000 (1998)                          2.111111  3.157895
Blues Brothers, The (1980)                          3.782609  3.848780

[100 rows x 2 columns]

In [ ]:
active_titles = number_ratings.index[number_ratings >100]

In [ ]:
active_titles

Index(['101 Dalmatians (1996)', '12 Angry Men (1957)',
       '2001: A Space Odyssey (1968)', 'Absolute Power (1997)',
       'Abyss, The (1989)', 'Ace Ventura: Pet Detective (1994)',
       'Adventures of Priscilla, Queen of the Desert, The (1994)',
       'African Queen, The (1951)', 'Air Force One (1997)', 'Aladdin (1992)',
       ...
       'Welcome to the Dollhouse (1995)', 'What's Eating Gilbert Grape (1993)',
       'When Harry Met Sally... (1989)', 'While You Were Sleeping (1995)',
       'William Shakespeare's Romeo and Juliet (1996)',
       'Willy Wonka and the Chocolate Factory (1971)',
       'Wizard of Oz, The (1939)', 'Wrong Trousers, The (1993)',
       'Young Frankenstein (1974)', 'Young Guns (1988)'],
      dtype='object', name='title', length=334)

In [ ]:
mean_ratings = avg_ratings.loc[active_titles]

In [ ]:
mean_ratings

                                                rating
title
101 Dalmatians (1996)                         2.908257
12 Angry Men (1957)                           4.344000
2001: A Space Odyssey (1968)                  3.969112
Absolute Power (1997)                         3.370079
Abyss, The (1989)                             3.589404
...                                                ...
Willy Wonka and the Chocolate Factory (1971)  3.631902
Wizard of Oz, The (1939)                      4.077236
Wrong Trousers, The (1993)                    4.466102
Young Frankenstein (1974)                     3.945000
Young Guns (1988)                             3.207921

[334 rows x 1 columns]

In [ ]:
avg_by_gender = avg_by_gender.loc[active_titles]

In [ ]:
avg_by_gender

gender                                               F         M
title
101 Dalmatians (1996)                         3.116279  2.772727
12 Angry Men (1957)                           4.269231  4.363636
2001: A Space Odyssey (1968)                  3.491228  4.103960
Absolute Power (1997)                         3.451613  3.343750
Abyss, The (1989)                             3.814815  3.540323
...                                                ...       ...
Willy Wonka and the Chocolate Factory (1971)  3.752688  3.583691
Wizard of Oz, The (1939)                      4.159420  4.045198
Wrong Trousers, The (1993)                    4.444444  4.472527
Young Frankenstein (1974)                     4.023810  3.924051
Young Guns (1988)                             3.230769  3.204545

[334 rows x 2 columns]

In [ ]:
top_male = avg_by_gender.sort_values(by='M', ascending= False)

In [ ]:
avg_by_gender['diff']=avg_by_gender['F'] - avg_by_gender['M']
avg_by_gender

gender                                               F         M      diff
title
101 Dalmatians (1996)                         3.116279  2.772727  0.343552
12 Angry Men (1957)                           4.269231  4.363636 -0.094406
2001: A Space Odyssey (1968)                  3.491228  4.103960 -0.612732
Absolute Power (1997)                         3.451613  3.343750  0.107863
Abyss, The (1989)                             3.814815  3.540323  0.274492
...                                                ...       ...       ...
Willy Wonka and the Chocolate Factory (1971)  3.752688  3.583691  0.168997
Wizard of Oz, The (1939)                      4.159420  4.045198  0.114223
Wrong Trousers, The (1993)                    4.444444  4.472527 -0.028083
Young Frankenstein (1974)                     4.023810  3.924051  0.099759
Young Guns (1988)                             3.230769  3.204545  0.026224

[334 rows x 3 columns]

In [ ]:
avg_by_gender.sort_values(by='diff',ascending=False)

gender                                         F         M      diff
title
First Wives Club, The (1996)            3.491525  2.742574  0.748951
My Fair Lady (1964)                     4.238095  3.602410  0.635686
Batman Forever (1995)                   3.173913  2.538462  0.635452
Net, The (1995)                         3.482759  2.857143  0.625616
Grease (1978)                           3.754386  3.141593  0.612793
...                                          ...       ...       ...
Bridge on the River Kwai, The (1957)    3.685714  4.307692 -0.621978
Waterworld (1995)                       2.263158  2.927711 -0.664553
Reservoir Dogs (1992)                   3.433333  4.127119 -0.693785
True Romance (1993)                     3.000000  3.727273 -0.727273
Good, The Bad and The Ugly, The (1966)  3.187500  3.950413 -0.762913

[334 rows x 3 columns]